### Data Manipulation and Analysis with Pandas
Data Manipulation and analysis are key tasks in any data science or data analysis project. Pandas provide a wide range of function for data analysis and manipulation. making it easy to clean, transform and extract insights from data.

In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('Orders.csv')
data.head()

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [3]:
data.tail()

    Order ID  Order Date CustomerName             State     City
495  B-25742  03-08-2018       Ashwin               Goa      Goa
496  B-26088  26-03-2018       Bhavna            Sikkim  Gangtok
497  B-25707  01-07-2018      Shivani       Maharashtra   Mumbai
498  B-25758  22-08-2018      Shubham  Himachal Pradesh    Simla
499  B-26095  28-03-2018      Monisha         Rajasthan   Jaipur

In [4]:
data.dtypes     # object=string

Order ID        object
Order Date      object
CustomerName    object
State           object
City            object
dtype: object

In [5]:
data.describe()

       Order ID  Order Date CustomerName        State    City
count       500         500          500          500     500
unique      500         307          336           19      25
top     B-26055  24-11-2018       Shreya  Maharashtra  Indore
freq          1           7            6           94      71

In [6]:
# Checkimg if there any any missing values in the dataset
data.isnull().sum()

Order ID        0
Order Date      0
CustomerName    0
State           0
City            0
dtype: int64

In [7]:
# filling missing names with 0
data['CustomerName(filled NA)']=data['CustomerName'].fillna('-')
data

,Order ID,Order Date,CustomerName,State,City,CustomerName(filled NA)
0,B-26055,10-03-2018,Harivansh,Uttar Pradesh,Mathura,Harivansh
1,B-25993,03-02-2018,Madhav,Delhi,Delhi,Madhav
2,B-25973,24-01-2018,Madan Mohan,Uttar Pradesh,Mathura,Madan Mohan
3,B-25923,27-12-2018,Gopal,Maharashtra,Mumbai,Gopal
4,B-25757,21-08-2018,Vishakha,Madhya Pradesh,Indore,Vishakha
...,...,...,...,...,...,...
495,B-25742,03-08-2018,Ashwin,Goa,Goa,Ashwin
496,B-26088,26-03-2018,Bhavna,Sikkim,Gangtok,Bhavna
497,B-25707,01-07-2018,Shivani,Maharashtra,Mumbai,Shivani
498,B-25758,22-08-2018,Shubham,Himachal Pradesh,Simla,Shubham
499,B-26095,28-03-2018,Monisha,Rajasthan,Jaipur,Monisha

In [8]:
data.drop('CustomerName',axis=1,inplace=True)

In [10]:
data.head()

  Order ID  Order Date           State     City CustomerName(filled NA)
0  B-26055  10-03-2018   Uttar Pradesh  Mathura               Harivansh
1  B-25993  03-02-2018           Delhi    Delhi                  Madhav
2  B-25973  24-01-2018   Uttar Pradesh  Mathura             Madan Mohan
3  B-25923  27-12-2018     Maharashtra   Mumbai                   Gopal
4  B-25757  21-08-2018  Madhya Pradesh   Indore                Vishakha

In [13]:
# Renaming Columns
data=data.rename(columns={'CustomerName(filled NA)':'Customer Name'})
data.head()

  Order ID  Order Date           State     City Customer Name
0  B-26055  10-03-2018   Uttar Pradesh  Mathura     Harivansh
1  B-25993  03-02-2018           Delhi    Delhi        Madhav
2  B-25973  24-01-2018   Uttar Pradesh  Mathura   Madan Mohan
3  B-25923  27-12-2018     Maharashtra   Mumbai         Gopal
4  B-25757  21-08-2018  Madhya Pradesh   Indore      Vishakha